yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/boot/rtl87x2g/system_rtl.c
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: LicenseRef-Realtek-5-Clause
 */

#include <locale.h>
#include <string.h>
#include <stdlib.h>
#include "app_section.h"
#include "debug_monitor.h"
#include "rtl876x.h"
#include "rtl876x_lib_platform.h"
#include "rom_uuid.h"
#include "patch_header_check.h"
#include "system_rtl876x.h"
#include "vector_table_ext.h"
#include "vector_table.h"
#include "os_mem.h"
#include "mem_config.h"
#include "os_sched.h"
#include "os_pm.h"
#include "trace.h"
#include "utils.h"
#include "flash_nor_device.h"
#include "version.h"
#include "aon_reg.h"
#include "wdt.h"
#include "rtl_gpio.h"
#include "otp.h"
#include "otp_config.h"
#include "ftl.h"
#include "fmc_api.h"
#include "clock.h"
#if (SUPPORT_NORMAL_OTA == 1)
#include "dfu_common.h"
#include "dfu_main.h"
#endif
#if (USE_PSRAM == 1)
#include "psram.h"
#endif
#if (SYSTEM_TRACE_ENABLE == 1)
#include "system_trace.h"
#include "trace_config.h"
#endif

#define BOOT_DIRECT_DEBUG        1
#define DEBUG_WATCHPOINT_ENABLE  0

/*os config*/
#define USE_ROM_OS      0
#define USE_FREERTOS    1
#define USE_RTT         2

bool system_init(void) APP_FLASH_TEXT_SECTION;

#if (ENCRYPT_RAM_CODE == 1)
extern char Image$$RAM_TEXT$$RO$$Base[];
extern char Load$$RAM_TEXT$$RO$$Base[];
extern char Load$$RAM_TEXT$$RO$$Length[];
#else
extern char Image$$FLASH_TEXT$$RO$$Base[];
extern char Load$$FLASH_TEXT$$RO$$Base[];
extern char Load$$FLASH_TEXT$$RO$$Length[];
#endif
#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
extern char Load$$LR$$LOAD_FLASH$$Base[];
#if (FEATURE_FLASH_SEC==1)
extern unsigned int Load$$LR$$LOAD_FLASH$$Length;
#endif
#elif defined (__GNUC__)
#if (FEATURE_FLASH_SEC==1)
extern uint32_t *__flash_sec_base_addr__;
extern uint32_t *__flash_sec_region_size__;
#endif
extern uint32_t *__app_flash_load_ad__;
#endif

BOOL_WDT_CB user_wdt_cb __attribute__((weak)) = NULL;
USER_CALL_BACK app_pre_main_cb __attribute__((weak)) = NULL ;
USER_CALL_BACK os_patch_init __attribute__((weak)) = NULL ;

#if defined (__GNUC__)
uint32_t _init_array __attribute__((weak));
extern uint32_t _einit_array __attribute__((alias("_init_array")));
#endif

T_SW_RESET_REASON sw_reset_reason;
T_WDT_RESET_TYPE  wdt_reset_type;

uint32_t random_seed_value;
void random_seed_init(void);
bool Reset_Handler(void);

const T_IMG_HEADER_FORMAT img_header APP_FLASH_HEADER =
{
    .auth =
    {
        .image_mac = {[0 ... 15] = 0xFF},
    },
    .ctrl_header =
    {
        .ic_type = IMG_IC_TYPE,
        .secure_version = 0,
#if (ENCRYPT_RAM_CODE == 1)
        .ctrl_flag.xip = 0,
#if (FEATURE_ENCRYPTION == 1)
        .ctrl_flag.enc = 1,
#else
        .ctrl_flag.enc = 0,
#endif
        .ctrl_flag.load_when_boot = 1,
        .ctrl_flag.enc_load = 0,
        .ctrl_flag.enc_key_select = ENC_KEY_OCEK,
#else
        .ctrl_flag.xip = 1,
        .ctrl_flag.enc = 0,
        .ctrl_flag.load_when_boot = 0,
        .ctrl_flag.enc_load = 0,
        .ctrl_flag.enc_key_select = 0,
#endif
        .ctrl_flag.not_obsolete = 1,
        .image_id = IMG_MCUAPP,
        .payload_len = 0x100,    //Will modify by build tool later
    },
    .uuid = DEFINE_symboltable_uuid,

#if (ENCRYPT_RAM_CODE == 1)
    /* to be modified based on different user scenario */
    .load_src = (uint32_t)Load$$RAM_TEXT$$RO$$Base,
    .load_dst = (uint32_t)Image$$RAM_TEXT$$RO$$Base,
    .load_len = (uint32_t)Load$$RAM_TEXT$$RO$$Length,
    .exe_base = (uint32_t)Image$$RAM_TEXT$$RO$$Base,
#else
    /* XIP test */
#if defined (__ARMCC_VERSION)
    .load_src = (uint32_t)Load$$FLASH_TEXT$$RO$$Base,
    .load_dst = (uint32_t)Image$$FLASH_TEXT$$RO$$Base,
    .load_len = 0,  //0 indicates all XIP
    .exe_base = (uint32_t)Image$$FLASH_TEXT$$RO$$Base,
#elif defined (__GNUC__)
    .load_src = (uint32_t)Reset_Handler,
    .load_dst = (uint32_t)Reset_Handler,
    .load_len = 0,  //0 indicates all XIP
    .exe_base = (uint32_t)Reset_Handler,
#endif
#endif
#if defined (__ARMCC_VERSION)
    .image_base = (uint32_t) &Load$$LR$$LOAD_FLASH$$Base,
#elif defined (__GNUC__)
    .image_base = (uint32_t) &__app_flash_load_ad__,
#endif
    .git_ver =
    {
        .ver_info.sub_version._version_major = VERSION_MAJOR,
        .ver_info.sub_version._version_minor = VERSION_MINOR,
        .ver_info.sub_version._version_revision = VERSION_REVISION,
        .ver_info.sub_version._version_reserve = VERSION_BUILDNUM % 32, //only 5 bit
        ._version_commitid = VERSION_GCID,
        ._customer_name = {CN_1, CN_2, CN_3, CN_4, CN_5, CN_6, CN_7, CN_8},
    },
#if (FEATURE_FLASH_SEC == 1)
    .flash_sec_cfg =
    {
        .ctrl_flag.enable = 1,
        .ctrl_flag.mode = 1,
        .ctrl_flag.key_select = ENC_KEY_OCEK_WITH_OEMCONST,
#if defined (__ARMCC_VERSION)
        .base_addr = (uint32_t) Load$$FLASH_TEXT$$RO$$Base,
        .region_size = (uint32_t) &Load$$LR$$LOAD_FLASH$$Length - 4096,
#elif defined (__GNUC__)
        .base_addr = (uint32_t) &__flash_sec_base_addr__,
        .region_size = (uint32_t) &__flash_sec_region_size__,
#endif
        .iv_high = {0x12, 0x34, 0x56, 0x78},
        .iv_low = {0x11, 0x22, 0x33, 0x44},
    },
#endif

    .ex_info.app_ram_info =
    {
        .app_ram_data_addr = NS_RAM_APP_ADDR,
        .app_ram_data_size = NS_RAM_APP_SIZE,
        .app_heap_data_on_size = NS_HEAP_SIZE,
        .ext_data_sram_size = EXT_DATA_SRAM_GLOBAL_SIZE,
    }
};


__WEAK void print_sdk_lib_version(void)
{
}

#if (DEBUG_WATCHPOINT_ENABLE == 1)
/**
 * @brief  Enable Debug Monitor Function (include NVIC Enable and DWT configuration)
 * @param  none
 * @return none
 */
void debug_monitor_enable(void)
{

    //set debug monitor priority
    NVIC_SetPriority(DebugMonitor_IRQn, 3);

    if ((CoreDebug->DHCSR & 0x1) != 0)
    {
        DBG_DIRECT("- Halting Debug Enabled - Can't Enable Monitor Mode Debug! -");
        return;
    }
    enable_debug_monitor();

    //watch_point_0_setting(0x00141d08, WORD, DEBUG_EVENT, FUNCTION_DADDR_W);
    //watch_point_1_setting(0x00450004, WORD, DEBUG_EVENT, FUNCTION_DADDR_W);

    return;
}
#endif

