yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/boot/rtl87x2g/system_rtl.c
__attribute__((weak)) int rtk_main(void)
{
#if defined (__ARMCC_VERSION)
    extern int __main(void);
    __main();
#elif defined (__GNUC__)
    extern int main(void);
    main();
#endif

    while (1)
    {
        //  "Error: main returned"
    }
}

void common_main(void)
{
    uint32_t cpu_clk = 0;
    pm_cpu_freq_get(&cpu_clk);
#if (BOOT_DIRECT_DEBUG == 1)
    if (FEATURE_TRUSTZONE_ENABLE)
    {
        DBG_DIRECT("Non-Secure World: common_main in app, Timestamp: %d us", read_cpu_counter() / cpu_clk);
    }
    else
    {
        DBG_DIRECT("Secure World: common_main in app, Timestamp: %d us", read_cpu_counter() / cpu_clk);
    }
#endif

//add common system code here before enter user defined main function

    // add xip vector wrapper for btmac handler, which has been updated in lowerstack init
#if (FEATURE_TRUSTZONE_ENABLE == 1)
    IRQ_Fun *pRamVector    = (IRQ_Fun *)NS_RAM_VECTOR_ADDR;
#else
    IRQ_Fun *pRamVector    = (IRQ_Fun *)S_RAM_VECTOR_ADDR;
#endif
    RamVectorTableUpdate_ext(BTMAC_VECTORn, (IRQ_Fun)pRamVector[BTMAC_VECTORn]);

    print_sdk_lib_version();

#if (SYSTEM_TRACE_ENABLE == 1)
    extern void system_trace_init(void);
    system_trace_init();

    extern void print_system_trace_lib_version(void);
    print_system_trace_lib_version();
#endif

    /*config bt stack parameters in rom*/
#ifdef BT_STACK_CONFIG_ENABLE
    bt_stack_config_init();
#endif

#if (FEATURE_TRUSTZONE_ENABLE == 1)
    /*target IRQs to non-secure*/
    setup_non_secure_nvic();
#endif

    random_seed_init();

    patch_func_ptr_init();

    if (!OTP->ftl_init_in_rom && OTP->use_ftl)
    {
        extern void (*flash_task_init)(void);
        flash_task_init();

#if (FTL_POOL == 1)
        extern int32_t ftl_pool_init(uint32_t ftl_pool_startAddr, uint32_t ftl_pool_size,
                                     uint16_t default_module_logicSize, uint8_t gc_page_thres);
        uint16_t rom_ftl_size = 0xC00;
        uint8_t ret = 0;
        uint8_t thres = 2; // default threshold val

#ifdef FTL_GC_PAGE_THRES_CUSTOMIZED
        thres = FTL_GC_PAGE_THRES_CUSTOMIZED
#endif
                ret = ftl_pool_init(flash_nor_get_bank_addr(FLASH_FTL),
                                    flash_nor_get_bank_size(FLASH_FTL),
                                    rom_ftl_size, thres);
        FLASH_PRINT_INFO1("[FTL] init ret=%d", ret);
#else
        extern uint32_t (*ftl_init)(uint32_t u32PageStartAddr, uint8_t pagenum);
        uint8_t ret = 0;
        ret = ftl_init(flash_nor_get_bank_addr(FLASH_FTL),
                       flash_nor_get_bank_size(FLASH_FTL) / 0x1000);
        FLASH_PRINT_INFO1("[FTL] init ret=%d", ret);
#endif
    }

#if (SUPPORT_NORMAL_OTA == 1)
    if (dfu_check_ota_mode_flag())
    {
        DBG_DIRECT("DFU TASK");
        dfu_main();
        dfu_set_ota_mode_flag(false);

        os_sched_start();
    }
#endif

#if defined ( __ICCARM__ )
    extern void __iar_program_start(const int);
    __iar_program_start(0);
#elif defined (__ARMCC_VERSION)
    rtk_main();
#elif defined (__GNUC__)
    typedef void (*init_fn_t)(void);
    init_fn_t *fp;
    // cppcheck-suppress comparePointers
    for (fp = (init_fn_t *)&_init_array; fp < (init_fn_t *)&_einit_array; fp++)
    {
        (*fp)();
    }
    rtk_main();
#endif
}

void random_seed_init(void)
{
    random_seed_value = platform_random(0xFFFFFFFF);
}

void ram_init(void) APP_FLASH_TEXT_SECTION;
void ram_init(void)
{
    unsigned int *section_image_base = 0;
    unsigned int *section_load_base = 0;
    unsigned int section_image_length = 0;

    //copy dtcm ro
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$ER_IRAM_NS$$RO$$Base;
    extern unsigned int Load$$ER_IRAM_NS$$RO$$Base;
    extern unsigned int Image$$ER_IRAM_NS$$RO$$Length;

    section_image_base = (unsigned int *)& Image$$ER_IRAM_NS$$RO$$Base;
    section_load_base = (unsigned int *)& Load$$ER_IRAM_NS$$RO$$Base;
    section_image_length = (unsigned int)& Image$$ER_IRAM_NS$$RO$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__enter_iram_ns_ro_exe_ad__;
    extern unsigned int *__enter_iram_ns_ro_load_ad__;
    extern unsigned int *__enter_iram_ns_ro_length__;

    section_image_base = (unsigned int *)& __enter_iram_ns_ro_exe_ad__;
    section_load_base = (unsigned int *)& __enter_iram_ns_ro_load_ad__;
    section_image_length = (unsigned int)& __enter_iram_ns_ro_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memcpy(section_image_base, section_load_base, section_image_length);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP copy DTCM RO: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);
#endif

    //copy dtcm rw
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$ER_IRAM_NS$$RW$$Base;
    extern unsigned int Load$$ER_IRAM_NS$$RW$$Base;
    extern unsigned int Image$$ER_IRAM_NS$$RW$$Length;

    section_image_base = (unsigned int *)& Image$$ER_IRAM_NS$$RW$$Base;
    section_load_base = (unsigned int *)& Load$$ER_IRAM_NS$$RW$$Base;
    section_image_length = (unsigned int)& Image$$ER_IRAM_NS$$RW$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__enter_iram_ns_rw_load_ad__;
    extern unsigned int *__enter_iram_ns_rw_length__;
    extern unsigned int *__enter_iram_ns_rw_start__;
    section_image_base = (unsigned int *)&__enter_iram_ns_rw_start__;
    section_load_base = (unsigned int *)& __enter_iram_ns_rw_load_ad__;
    section_image_length = (unsigned int)& __enter_iram_ns_rw_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memcpy(section_image_base, section_load_base, section_image_length);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP copy DTCM rw: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);
#endif

    //clear dtcm zi
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$ER_IRAM_NS$$ZI$$Base;
    extern unsigned int Image$$ER_IRAM_NS$$ZI$$Length;

    section_image_base = (unsigned int *)& Image$$ER_IRAM_NS$$ZI$$Base;
    section_image_length = (unsigned int)& Image$$ER_IRAM_NS$$ZI$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__enter_iram_ns_zi_start__;
    extern unsigned int *__enter_iram_ns_zi_length__;

    section_image_base = (unsigned int *)& __enter_iram_ns_zi_start__;
    section_image_length = (unsigned int)& __enter_iram_ns_zi_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memset(section_image_base, 0, section_image_length);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP clear DTCM zi: addr 0x%x, len %d", (uint32_t)section_image_base,
               section_image_length);
#endif

