yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/boot/rtl87x2g/system_rtl.c
    }

    __DMB();
    __DSB();
}

uint32_t reset_reason_print(void) APP_FLASH_TEXT_SECTION;
uint32_t reset_reason_print(void)
{
    uint32_t result = 0;

    AON_NS_REG0X_APP_TYPE aon_0x1ae0 = {.d32 = AON_REG_READ(AON_NS_REG0X_APP)};
    sw_reset_reason = aon_0x1ae0.reset_reason;
    aon_0x1ae0.reset_reason = RESET_REASON_HW;
    AON_REG_WRITE(AON_NS_REG0X_APP, aon_0x1ae0.d32);

    AON_NS_REG_KM4_WDT_MODE_TYPE wdg_reset_flag;
    wdg_reset_flag.d32 = AON_REG_READ(AON_NS_REG_KM4_WDT_MODE);

    uint32_t wdg_reset_pc = AON_REG_READ(AON_NS_REG30_CORE_KM4_PC);
    uint32_t wdg_reset_lr = AON_REG_READ(AON_NS_REG34_CORE_KM4_LR);
    uint32_t wdg_reset_psr = AON_REG_READ(AON_NS_REG3C_CORE_KM4_XPSR_R);

    AON_NS_REG_AON_WDT_MODE_TYPE aon_wdg_reset_flag;
    aon_wdg_reset_flag.d32 = AON_REG_READ(AON_NS_REG_AON_WDT_MODE);

    uint32_t aon_wdg_reset_pc = AON_REG_READ(AON_NS_REG50_AON_KM4_PC);
    uint32_t aon_wdg_reset_lr = AON_REG_READ(AON_NS_REG54_AON_KM4_LR);
    uint32_t aon_wdg_reset_psr = AON_REG_READ(AON_NS_REG5C_AON_KM4_XPSR_R);

    BOOT_PRINT_INFO1("[Debug Info]RESET Reason: SW, TYPE 0x%x", sw_reset_reason);
    BOOT_PRINT_INFO2("[Debug Info]WDG timeout flag 0x%x, WDG mode 0x%x",
                     wdg_reset_flag.r_km4_wdt_timeout_flag, wdg_reset_flag.r_km4_wdt_mode);
    BOOT_PRINT_INFO2("[Debug Info]AON WDG timeout flag 0x%x,AON WDG mode 0x%x",
                     aon_wdg_reset_flag.r_aon_wdt_timeout_flag, aon_wdg_reset_flag.r_aon_wdt_mode);

    BOOT_PRINT_INFO3("[Debug Info]WDG: pc %x, lr %x, psr %x", wdg_reset_pc, wdg_reset_lr,
                     wdg_reset_psr);
    BOOT_PRINT_INFO3("[Debug Info]AON WDG: pc %x, lr %x, psr %x", aon_wdg_reset_pc, aon_wdg_reset_lr,
                     aon_wdg_reset_psr);

    if (wdg_reset_flag.r_km4_wdt_timeout_flag == 0 &&
        aon_wdg_reset_flag.r_aon_wdt_timeout_flag == 0)
    {
        if (sw_reset_reason == RESET_REASON_HW)
        {
            BOOT_PRINT_INFO0("[Debug Info]HW Reset");
            wdt_reset_type = HW_RESET;
            result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
        }
        else if (sw_reset_reason == RESET_REASON_DLPS)
        {
            BOOT_PRINT_INFO0("[Debug Info]AON WDT Timeout Reset in DLPS");
            wdt_reset_type = AON_WDT_RESET_DLPS;
            result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
        }
    }
    else
    {
        if (sw_reset_reason == RESET_REASON_HW)
        {
            if (wdg_reset_flag.r_km4_wdt_timeout_flag == 1 && wdg_reset_flag.r_km4_wdt_mode == 0)
            {
                BOOT_PRINT_INFO0("[Debug Info]Core WDT Timeout Reset, level 0");
                wdt_reset_type = CORE_WDT_RESET_LV0;
                sw_reset_reason = RESET_REASON_WDT_TIMEOUT;
                result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
            }
            else if (wdg_reset_flag.r_km4_wdt_timeout_flag == 1 && wdg_reset_flag.r_km4_wdt_mode == 1)
            {
                BOOT_PRINT_INFO0("[Debug Info]Core WDT Timeout Reset, level 1");
                wdt_reset_type = CORE_WDT_RESET_LV1;
                sw_reset_reason = RESET_REASON_WDT_TIMEOUT;
                result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
            }
            else if (aon_wdg_reset_flag.r_aon_wdt_timeout_flag == 1 && aon_wdg_reset_flag.r_aon_wdt_mode == 0)
            {
                BOOT_PRINT_INFO0("[Debug Info]AON WDT Timeout Reset, level 0");
                wdt_reset_type = AON_WDT_RESET_LV0;
                sw_reset_reason = RESET_REASON_WDT_TIMEOUT;
                result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
            }
            else if (aon_wdg_reset_flag.r_aon_wdt_timeout_flag == 1 && aon_wdg_reset_flag.r_aon_wdt_mode == 1)
            {
                BOOT_PRINT_INFO0("[Debug Info]AON WDT Timeout Reset, level 1");
                wdt_reset_type = AON_WDT_RESET_LV1;
                sw_reset_reason = RESET_REASON_WDT_TIMEOUT;
                result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
            }
        }
        else
        {
            BOOT_PRINT_INFO1("[Debug Info]System Reset, TYPE 0x%x", sw_reset_reason);
            wdt_reset_type = SYSTEM_RESET_REASON;
            result = ((uint16_t)wdt_reset_type << 8) | sw_reset_reason;
        }
    }

    return result;
}

void pre_main(void) APP_FLASH_TEXT_SECTION;
void pre_main(void)
{
    uint32_t cpu_clk = 0;
    pm_cpu_freq_get(&cpu_clk);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP pre_main, Timestamp: %d us", read_cpu_counter() / cpu_clk);
#endif
    __disable_irq();

    reset_reason_print();

    setlocale(LC_ALL, "C");

    BOOT_PRINT_INFO1("SDK Ver: %s",
                     TRACE_STRING(VERSION_BUILD_STR));

    AppUpdateVectorTable();

#if (DEBUG_WATCHPOINT_ENABLE == 1)
    debug_monitor_enable();
#endif

#if (DEFAULT_FLASH_BP_LEVEL_ENABLE == 1)
    fmc_flash_set_default_bp_lv(true);
#else
    fmc_flash_set_default_bp_lv(false);
#endif

    // flash 4 byte address mode
    uint32_t flash_id = flash_nor_get_id(FLASH_NOR_IDX_SPIC0);
    if ((flash_id & 0xF) == 9)
    {
        extern bool fmc_flash_set_4_byte_address_mode(FMC_FLASH_NOR_IDX_TYPE idx, bool enable);
        fmc_flash_set_4_byte_address_mode(FMC_FLASH_NOR_IDX0, 1);
    }

    if (app_pre_main_cb)
    {
        app_pre_main_cb();
    }

    return;
}

bool system_init(void) APP_FLASH_TEXT_SECTION;
bool system_init(void)
{

    //hci mode check and bypass app
    if (OTP->stack_en == 0)
    {
        DBG_DIRECT("WARNING: In HCI Mode, will not run APP Task, Timestamp: %d us",
                   read_cpu_counter() / 40);
        return true;
    }
    else
    {
        DBG_DIRECT("In SoC Mode, Timestamp: %d us", read_cpu_counter() / 40);
    }

#if (BOOT_DIRECT_DEBUG == 1)
    if (FEATURE_TRUSTZONE_ENABLE)
    {
        DBG_DIRECT("Non-secure APP Entry");
    }
    else
    {
        DBG_DIRECT("Secure APP Entry");
    }

#endif

#if (USE_PSRAM == 1)
    psram_winbond_opi_init();
#endif

    ram_init();

    bool use_psram = fmc_get_psram_power_status();
#if (USE_PSRAM == 1)
    if (use_psram == 0)
    {
        DBG_DIRECT("psram is initialized but not powered on!");
    }
#else
    if (use_psram == 1)
    {
        DBG_DIRECT("psram is powered on but not initialized!");
    }
#endif

