yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/boot/rtl87x2g/system_rtl.c
    //init pre_main and main functions
    app_pre_main = (APP_MAIN_FUNC)pre_main;
    app_main = (APP_MAIN_FUNC)common_main;

    wdg_register_app_cb((WDG_APP_CB)wdg_system_reset_app_cb);

    //add update OTP here

    //sw timer config
#ifdef TIMER_MAX_NUMBER
    //define TIMER_MAX_NUMBER in otp_config.h
    OTP->timerMaxNumber = TIMER_MAX_NUMBER;
#endif

    //timer task stack size config
#ifdef TIMER_TASK_STACK_SIZE
    //define TIMER_TASK_STACK_SIZE in otp_config.h
    OTP->timer_task_stack_size = TIMER_TASK_STACK_SIZE;
#endif

    //cpu_sleep_en config
#ifdef CPU_SLEEP_EN
    //define CPU_SLEEP_EN in otp_config.h
    OTP->cpu_sleep_en = CPU_SLEEP_EN;
#endif

    //os tick time config
#ifdef OS_TICK_TIME
    //define OS_TICK_TIME in otp_config.h
    set_os_clock(OS_TICK_TIME);
#endif

    //ftl config
#ifdef USE_FTL
    //define USE_FTL in otp_config.h
    OTP->use_ftl = USE_FTL;
#endif

#ifndef FTL_POOL
    //define FTL_LOGIC_ADDR_MAP_BIT_MAP in otp_config.h
#ifdef FTL_LOGIC_ADDR_MAP_BIT_MAP
    OTP->ftl_logic_addr_map_bit_num = FTL_LOGIC_ADDR_MAP_BIT_MAP;
#else
    OTP->ftl_logic_addr_map_bit_num = 3;
#endif
#endif

    // swd pinmux config
#ifdef SWD_PINMUX_ENABLE
    //define SWD_PINMUX_ENABLE in otp_config.h
#if (SWD_PINMUX_ENABLE == 0)
    swd_pin_disable();
#endif
#endif

    //add multi-OS support
#if (MULT_OS == USE_FREERTOS)
    extern void os_freertos_patch_init(void);
    os_patch_init = os_freertos_patch_init;
#elif (MULT_OS == USE_RTT)   // RT-Thread OS
    extern void os_rtt_patch_init(void);
    os_patch_init = os_rtt_patch_init;
#endif

    //heap_ext_data_sram_mask_en config
#ifdef HEAP_EXT_DATA_SRAM_MASK_EN
    //define HEAP_EXT_DATA_SRAM_MASK_EN in otp_config.h
    OTP->heap_mask.heap_ext_data_sram_mask = HEAP_EXT_DATA_SRAM_MASK_EN;
#endif

    //log_ram_size config
#ifdef LOG_RAM_SIZE
    //define LOG_RAM_SIZE in otp_config.h
    OTP->log_ram_size = LOG_RAM_SIZE;
#endif

    /*Debug: config enable write hardfault record to flash*/
#if (WRITE_HARDFAULT_RECORD_TO_FLASH_ENABLE > 0)
    OTP->write_info_to_flash_when_hardfault = WRITE_HARDFAULT_RECORD_TO_FLASH_ENABLE;
    OTP->HardFault_Record_BegAddr = HARDFAULT_RECORD_BEG_ADDR;
    OTP->HardFault_Record_EndAddr = HARDFAULT_RECORD_END_ADDR;
    OTP->HardFault_Record_CFG = HARDFAULT_RECORD_CFG;
#endif

#if (WRITE_HARDFAULT_RECORD_TO_FLASH_ENABLE > 0) && (SYSTEM_TRACE_ENABLE == 1) && (TRACE_HARDFAULT == 1)
    patch_hardfault_save_to_flash_init();
#endif

    return true;
}

void Peripheral_Handler(void) APP_RAM_TEXT_SECTION;
void Peripheral_Handler(void)
{
    //DBG_DIRECT("Peri_Handler");
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;

    uint32_t peripheral_interrupt_status = SoC_VENDOR->u_004.REG_LOW_PRI_INT_STATUS;
    uint32_t real_interrupt_status = peripheral_interrupt_status &
                                     (SoC_VENDOR->u_00C.REG_LOW_PRI_INT_EN);

    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[Peripheral_First_VECTORn + idx]();
        real_interrupt_status &= ~BIT(idx);
    }

    //Clear sub-rout IRQ
    HAL_WRITE32(SOC_VENDOR_REG_BASE, 0x4, peripheral_interrupt_status);
}

void GPIOA_Handler(uint32_t mask) APP_RAM_TEXT_SECTION;
void GPIOA_Handler(uint32_t mask)
{
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;
    uint32_t real_interrupt_status = GPIOA->GPIO_INT_STS & mask ;
    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[GPIOA2_VECTORn + idx - 2]();
        real_interrupt_status &= ~BIT(idx);
    }
}

void GPIO_A_2_7_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_2_7_Handler(void)
{
    GPIOA_Handler(0xFC);
}

void GPIO_A_8_15_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_8_15_Handler(void)
{
    GPIOA_Handler(0xFF00);
}

void GPIO_A_16_23_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_16_23_Handler(void)
{
    GPIOA_Handler(0xFF0000);
}

void GPIO_A_24_31_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_24_31_Handler(void)
{
    GPIOA_Handler(0xFF000000);
}

void GPIOB_Handler(uint32_t mask) APP_RAM_TEXT_SECTION;
void GPIOB_Handler(uint32_t mask)
{
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;
    uint32_t real_interrupt_status = GPIOB->GPIO_INT_STS & mask ;
    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[GPIOB0_VECTORn + idx]();
        real_interrupt_status &= ~BIT(idx);
    }
}

void GPIO_B_0_7_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_0_7_Handler(void)
{
    GPIOB_Handler(0xFF);
}

void GPIO_B_8_15_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_8_15_Handler(void)
{
    GPIOB_Handler(0xFF00);
}

void GPIO_B_16_23_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_16_23_Handler(void)
{
    GPIOB_Handler(0xFF0000);
}

void GPIO_B_24_31_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_24_31_Handler(void)
{
    GPIOB_Handler(0xFF000000);
}

#define FreeRTOS_portBYTE_ALIGNMENT    8

typedef struct A_BLOCK_LINK
{
    struct A_BLOCK_LINK *pxNextFreeBlock;   /*<< The next free block in the list. */
    size_t xBlockSize : 28;                 /*<< The size of the free block. */
    size_t xRamType : 3;
    size_t xAllocateBit : 1;
} BlockLink_t;

static void *freertos_realloc(void *ptr, size_t size)
{
    void *new_ptr;
    BlockLink_t *pxLink;
    size_t old_size, new_size = 0;

    if (ptr == NULL)
    {
        return os_mem_alloc(RAM_TYPE_DATA_ON, size);
    }

    if (size == 0)
    {
        os_mem_free(ptr);
        ptr = NULL;
        return NULL;
    }

    pxLink = (BlockLink_t *)((uint8_t *)ptr - sizeof(BlockLink_t));
    old_size = pxLink->xBlockSize;

    if ((old_size - sizeof(BlockLink_t)) ==
        (size + (FreeRTOS_portBYTE_ALIGNMENT - (size & (FreeRTOS_portBYTE_ALIGNMENT - 1)))))
    {
        return ptr;
    }

    os_sched_suspend();
    os_mem_free(ptr);
    new_ptr = os_mem_alloc(RAM_TYPE_DATA_ON, size);
    if (ptr != new_ptr)
    {
        pxLink = (BlockLink_t *)((uint8_t *)new_ptr - sizeof(BlockLink_t));
        new_size = pxLink->xBlockSize;
        memcpy(new_ptr, ptr, (old_size < new_size) ? (old_size - sizeof(BlockLink_t)) : (new_size - sizeof(
                    BlockLink_t)));
    }
    os_sched_resume();

    return new_ptr;
}

#if defined(__ARMCC_VERSION)

/*retarget to weak function to ensure that the application has freedom of redefinition*/
__WEAK void *malloc(size_t size)
{
    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

__WEAK void *calloc(size_t n, size_t size)
{
    return os_mem_zalloc(RAM_TYPE_DATA_ON, n * size);
}

/*only for FreeRTOS*/
__WEAK void *realloc(void *ptr, size_t size)
{
    return freertos_realloc(ptr, size);
}

__WEAK void free(void *ptr)
{
    os_mem_free(ptr);
}

#else

/*
 * The linker will redirect 'malloc' to '__wrap_malloc'
 * and 'free' to '__wrap_free'.
 */

__attribute__((weak)) void *__wrap__malloc_r(struct _reent *r, size_t size)
{
    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

__attribute__((weak)) void __wrap__free_r(struct _reent *r, void *ptr)
{
    os_mem_free(ptr);
}

__attribute__((weak)) void *__wrap__calloc_r(struct _reent *r, size_t nmemb, size_t size)
{
    return os_mem_zalloc(RAM_TYPE_DATA_ON, nmemb * size);
}

__attribute__((weak)) void *__wrap__realloc_r(struct _reent *r, void *ptr, size_t size)
{
    return freertos_realloc(ptr, size);
}

#endif
